<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d1c508db77ca0c3e7a13669ec56f3b30b075f21027b24086cbe82db7e7830607","plan_job_ref":"Job Terraform-plan #3 at https://github.com/ChrisHilsdon-6point6/terraform-aws-billing-alert/actions/runs/6773574496","plan_hash":"45cd2e37a57cb7d3381d846010a34777cedfa942137bb6b753721373ef2cd736","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__<details open><summary>With variables</summary>

```hcl
aws_access_key  = (sensitive value)
aws_region      = (sensitive value)
aws_secret_key  = (sensitive value)
cw_alarm_period = "6"
sns_alert_email = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.zero_spend_budget_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "zero_spend_budget_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This alarm helps keep within AWS free tier limits."
      + alarm_name                            = "zero_spend_budget"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EstimatedCharges"
      + namespace                             = "AWS/Billing"
      + period                                = 21600
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 0.01
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.zero_spend_budget_alert will be created
  + resource "aws_sns_topic" "zero_spend_budget_alert" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "zero_spend_budget_alert"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.zero_spend_budget_subscription will be created
  + resource "aws_sns_topic_subscription" "zero_spend_budget_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform-apply #8](https://github.com/ChrisHilsdon-6point6/terraform-aws-billing-alert/actions/runs/6773588961)